package sec10객체지향프로그램.exam02;

public class 필드 {

	public static void main(String[] args) {
		키워드:필드선언,필드사용
		필드는 개인의 고유데이터 부품객체 상태정보 저징
		필드를선언하고 생성한뒤 이를 읽고 변경하는 방벙을 학습
		필드(field):객체의고유데이터,객체가 가져야할부품, 객체의현재상태 데이터등을저장
		
		필드선언:클래스 중괄호 블록 어디서든 존재가능
		생성자와 메소드 중괄호 블록 내부에는 선언불가 xxx[]{             }<이게생성자  
		void methood[...]{             } <메소드 
		변수와 선언 형태 유사하거나 변수아님에주의
		
		clss xxx {
		String company = "현대자동차";
		int maxSpeed = 300;
		}      이런식이 필드
		
		초기값을 줄수도있고 생략할수도있음
		정수타입은기본적으로 0이들어감 
		실수타입이라면 0.0 or 0.0f 
		논히타입이라면 false
		참조타입이라면 null
		
		
		
		
		
		
		
		
	}

}
